stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_cmd.c
/*
******************************************************************************
* @file    stm32_term_cmd.c
* @author  MCD Application Team
* @brief   Custom definition of commands for terminal
******************************************************************************
* @attention
*
* Copyright (c) 2022(-2022) STMicroelectronics.
* All rights reserved.
*
* This software is licensed under terms that can be found in the LICENSE file
* in the root directory of this software component.
* If no LICENSE file comes with this software, it is provided AS-IS.
*
******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdbool.h>
#include <stdio.h>
#include <errno.h>
#include "stm32_term_conf.h"
#include "stm32_term.h"
#include "audio_chain_instance.h"
#include "cycles_measure.h"
#include "algos_memory_usage.h"
#ifdef USE_ETHERNET
  #include "network.h"
#endif
#include "audio_algo_tuning.h"
#include "st_json.h"

/* Global variables ----------------------------------------------------------*/

/* Private defines -----------------------------------------------------------*/
#define MAX_CHUNK_DESCR_STR_SIZE     (200)
#define UTIL_TERM_CMD_JSON_BUFF_SIZE (10UL * 1024UL)
#define AC_PARAM_NAME_LENGTH_MAX     (100U)

/* Private macros ------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  const char *pTitle;
  const char *pID;
  const char *pCmd;
  const char *pType;
  uint32_t (*get_value_cb)(void);
}
cfg_def_toolsbar_t;

typedef struct
{
  char pJsonBuff[UTIL_TERM_CMD_JSON_BUFF_SIZE];
}
UTIL_TERM_CMD_t;

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
static void       s_cmd_get_algo_list(int        argc, char *argv[]);
static void       s_cmd_get_cfg(int              argc, char *argv[]);
static void       s_cmd_set_cycles_cnt_state(int argc, char *argv[]);
static void       s_cmd_print_cpu_status(int     argc, char *argv[]);
static void       s_cmd_print_mem_status(int     argc, char *argv[]);
static void       s_cmd_print_mem2_status(int    argc, char *argv[]);
static void       s_cmd_set_traces_state(int     argc, char *argv[]);

static bool       s_check_args_boolean(int argc, char *argv[], bool *const pBoolean);

static uint32_t   s_get_cycles_cnt_status_cb(void);
static uint32_t   s_get_trace_status_cb(void);

static jsonErr    s_get_cfg_build_tools_bar(json_pack_t        *const pInstance, jsonID const root);
static jsonErr    s_update_json_graph_connections(json_pack_t  *const pInstance, jsonID const root);
static jsonErr    s_update_json_from_ac_params(json_pack_t     *const pInstance, jsonID const algoJsonId, audio_algo_t *const pAlgo, audio_algo_tuning_stat_dyn_param_t const statDynParam);
static jsonErr    s_update_json_graph_system_chunk(json_pack_t *const pInstance, jsonID const root, audio_chunk_list_t *const pChunkList, const char *const strType);
static jsonErr    s_update_json_graph_system_ios(json_pack_t   *const pInstance, jsonID const root);
//static void       s_cmd_toggle_usb_rec(int argc, char *argv[]);
static void       s_cmd_get_generic_info(int argc, char *argv[]);

#ifdef USE_ETHERNET
  static void     s_cmd_set_net_traces_state(int argc, char *argv[]);
  static uint32_t s_get_net_trace_status_cb(void);
#endif

#if defined(AUDIO_CHAIN_ACSDK_USED) || defined(AUDIO_CHAIN_CONF_TUNING_CLI_USED)
/* Private variables ---------------------------------------------------------*/
static const char *const s_pStrParamType[] =
{
  [AUDIO_ALGO_STATIC_PARAM]  = "Static",
  [AUDIO_ALGO_DYNAMIC_PARAM] = "Dynamic"
};

static const char *const s_pStrJsonParamType[] =
{
  [AUDIO_ALGO_STATIC_PARAM]  = "StaticParameters",
  [AUDIO_ALGO_DYNAMIC_PARAM] = "DynamicParameters"
};

/* Private function prototypes -----------------------------------------------*/
static void     s_cmd_get_all_algo_param_list(int argc, char *argv[]);
static void     s_cmd_get_all_param_list(int      argc, char *argv[]);
static void     s_cmd_get_dynamic_param_list(int  argc, char *argv[]);
static void     s_cmd_get_dynamic_param_val(int   argc, char *argv[]);
static void     s_cmd_set_dynamic_param_val(int   argc, char *argv[]);
static void     s_cmd_apply_dynamic_param_val(int argc, char *argv[]);
static void     s_cmd_get_static_param_list(int   argc, char *argv[]);
static void     s_cmd_get_static_param_val(int    argc, char *argv[]);
static void     s_cmd_set_static_param_val(int    argc, char *argv[]);
static void     s_cmd_apply_static_param_val(int  argc, char *argv[]);
static void     s_cmd_apply_cfg(int               argc, char *argv[]);
static void     s_cmd_set_cfg(int                 argc, char *argv[]);

static void     s_args_get_param_list(int         argc, char *argv[], audio_algo_tuning_stat_dyn_param_t const statDynParam);
static void     s_args_get_param_val(int          argc, char *argv[], audio_algo_tuning_stat_dyn_param_t const statDynParam);
static int      s_args_set_param_val(int          argc, char *argv[], audio_algo_tuning_stat_dyn_param_t const statDynParam);

static int      s_check_args_algoId_paramId(int   argc, char *argv[], audio_algo_t **const ppAlgo, uint8_t *const pAlgoId, uint8_t *const pParamId, audio_algo_tuning_stat_dyn_param_t const statDynParam);
static int      s_check_args_algoId(int           argc, char *argv[], audio_algo_t **const ppAlgo, uint8_t *const pAlgoId);

static void     s_set_param_val(audio_algo_t          *pAlgo, uint8_t const algoId, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId, char *const pStrParamVal);
static void     s_print_param_val(audio_algo_t        *pAlgo, uint8_t const algoId, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId);
static int32_t  s_getParamValStrWithName(audio_algo_t *pAlgo, uint8_t const algoId, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId, char *const pString, size_t const size);

