stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_cmd.c
static jsonErr  s_update_json_from_ac_param(json_pack_t  *const pInstance, jsonID const paramTypeJsonId, audio_algo_t *const pAlgo, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId);
static jsonErr  s_update_ac_param_from_json(json_pack_t  *const pInstance, jsonID const paramTypeJsonId, audio_algo_t *const pAlgo, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId);
static jsonErr  s_update_ac_params_from_json(json_pack_t *const pInstance, jsonID const algoJsonId,      audio_algo_t *const pAlgo, audio_algo_tuning_stat_dyn_param_t const statDynParam);
#endif

//__weak void  toggle_usb_rec(void);
__weak void  get_infos(void);



/**
* @brief Command definition
*
*/
const UTIL_TERM_cmd_str_entry_t gUTIL_TERM_customCmds[] =
{
  {"help",              NULL,                             "This help",                                                   UTIL_TERM_cmd_help,                0},
  {"reboot",            NULL,                             "Reboot the board",                                            UTIL_TERM_cmd_reboot,              0},
  {"get_algo_list",     NULL,                             "display algo list in current graph",                          s_cmd_get_algo_list,               0},
  #if defined(AUDIO_CHAIN_ACSDK_USED) || defined(AUDIO_CHAIN_CONF_TUNING_CLI_USED)
  {"get_all_par",       NULL,                             "display all algo's static & dynamic param",                   s_cmd_get_all_algo_param_list,     0},
  {"get_par_list",      "algo id",                        "display algo's static & dynamic param list",                  s_cmd_get_all_param_list,          0},
  {"get_stat_par_list", "algo id",                        "display algo's static param list",                            s_cmd_get_static_param_list,       0},
  {"get_dyn_par_list",  "algo id",                        "display algo's dynamic param list",                           s_cmd_get_dynamic_param_list,      0},
  {"get_stat_par",      "algo id, param id",              "display algo's static param value",                           s_cmd_get_static_param_val,        0},
  {"get_dyn_par",       "algo id, param id",              "display algo's dynamic param value",                          s_cmd_get_dynamic_param_val,       0},
  {"set_stat_par",      "algo id, param id, param value", "set algo's static param value (not applied)",                 s_cmd_set_static_param_val,        0},
  {"set_dyn_par",       "algo id, param id, param value", "set algo's dynamic param value (not applied)",                s_cmd_set_dynamic_param_val,       0},
  {"apply_stat_par",    "algo id, param id, param value", "set algo's static param value and apply it",                  s_cmd_apply_static_param_val,      0},
  {"apply_dyn_par",     "algo id, param id, param value", "set algo's dynamic param value and apply it",                 s_cmd_apply_dynamic_param_val,     0},
  {"apply_cfg",         "algo id",                        "apply new algo's config (static & dynamic params)",           s_cmd_apply_cfg,                   0},
  {"set_cfg",           "[quiet]",                        "Apply the json configuration",                                s_cmd_set_cfg,                     0},
  #endif
  {"get_cfg",           "[compact]",                      "Show the json configuration",                                 s_cmd_get_cfg,                     0},
  {"cpu",               NULL,                             "Print the cpu status",                                        s_cmd_print_cpu_status,            0},
  {"mem",               NULL,                             "Print the memory status with algos memory usage summary",     s_cmd_print_mem_status,            0},
  {"mem2",              NULL,                             "Print the memory status with algos detailed memory usage",    s_cmd_print_mem2_status,           0},
  {"set_cycles_cnt",    "0 or 1",                         "enable(1) disable(0) cycle counting",                         s_cmd_set_cycles_cnt_state,        0},
  {"set_traces",        "0 or 1",                         "enable(1) disable(0) traces",                                 s_cmd_set_traces_state,            0},
  #ifdef USE_ETHERNET
  {"set_net_traces",    "0 or 1",                         "enable(1) disable(0) network traces",                         s_cmd_set_net_traces_state,        0},
  #endif
  //  {"toggle_usb_rec",    NULL,                             "toggles from Mic to Afe output",                              s_cmd_toggle_usb_rec,              0},
  {"get_infos",         NULL,                             "user defined command, up to the developer to implemented it", s_cmd_get_generic_info,            0},

  {NULL,                NULL,                             NULL,                                                          NULL,                              0}
};


/* Functions Definition ------------------------------------------------------*/

/**
* @brief Must return pointer on custom commands
*
* @param argc  num args
* @param argv  args list
*/
UTIL_TERM_cmd_str_entry_t const *UTIL_TERM_getCustomCommands(void)
{
  return gUTIL_TERM_customCmds;
}


/* Static Functions Definition -----------------------------------------------*/

static void s_cmd_get_algo_list(int argc, char *argv[])
{
  if (AudioChain_getAlgosList(&AudioChainInstance) == NULL)
  {
    UTIL_TERM_printf("No Audio Chain is instantiated\n");
  }
  for (audio_algo_list_t *pCurrent = AudioChain_getAlgosList(&AudioChainInstance); pCurrent != NULL; pCurrent = pCurrent->next)
  {
    audio_algo_t *pAlgo = pCurrent->pAlgo;

    UTIL_TERM_printf("%2d: %s %s\n", AudioAlgo_getIndex(pAlgo), pAlgo->pName, pAlgo->pDesc);
  }
}


static void s_cmd_set_cycles_cnt_state(int argc, char *argv[])
{
  bool enable;

  if (s_check_args_boolean(argc, argv, &enable))
  {
    AudioChainInstance_setEnableCyclesCnt(enable);
  }
}

static void s_cmd_print_cpu_status(int argc, char *argv[])
{
  cyclesMeasure_values_t cyclesMeasure_values;

  displayDetailedCycleCount(true, false, &cyclesMeasure_values);
}


static void s_cmd_print_mem_status(int argc, char *argv[])
{
  displayDetailedAlgosMemoryUsage(false);
}


static void s_cmd_print_mem2_status(int argc, char *argv[])
{
  displayDetailedAlgosMemoryUsage(true);
}


static void s_cmd_set_traces_state(int argc, char *argv[])
{
  bool enable;

  if (s_check_args_boolean(argc, argv, &enable))
  {
    AudioChainInstance_setEnableTraces(enable);
  }
}


static bool s_check_args_boolean(int argc, char *argv[], bool *const pBoolean)
{
  bool ok = true;

