stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_cmd.c
  if (argc == 2)
  {
    if (AudioAlgoTuning_isSignedDecimal(argv[1]))
    {
      int boolean;

      errno = 0;
      boolean = (int)strtol(argv[1], NULL, 10);
      if (errno != 0)
      {
        UTIL_TERM_printf("%s command: strtol error\n", argv[0]);
        ok = false;
      }
      if (ok)
      {
        if ((boolean != 0) && (boolean != 1))
        {
          UTIL_TERM_printf("%s command: %s is not a boolean\n", argv[0], argv[1]);
          ok = false;
        }
        else
        {
          *pBoolean = (boolean == 1);
        }
      }
    }
    else
    {
      UTIL_TERM_printf("%s command: %s is not an integer\n", argv[0], argv[1]);
      ok = false;
    }
  }
  else
  {
    UTIL_TERM_printf("%s command: wrong number of arguments\n", argv[0]);
    ok = false;
  }

  return ok;
}


/****************************/
/* JSON management routines */
/****************************/

static uint32_t s_get_trace_status_cb(void)
{
  return (uint32_t)AudioChainInstance_getTracesStatus();
}


static uint32_t s_get_cycles_cnt_status_cb(void)
{
  return (uint32_t)AudioChainInstance_getCyclesCntStatus();
}


/**
* @brief Expose the terminal boutton bar
* @params pInstance json instance
* @param root json root id
*/
static jsonErr s_get_cfg_build_tools_bar(json_pack_t *const pInstance, jsonID const root)
{
  static const cfg_def_toolsbar_t tToolsBar[] =
  {
    {
      .pTitle       = "Help",
      .pID          = "ToolBar#00",
      .pCmd         = "help",
      .pType        = "push", /* push button to send a command */
      .get_value_cb = NULL
    },
    {
      .pTitle       = "Toggle traces",
      .pID          = "ToolBar#01",
      .pCmd         = "set_traces {0}",
      .pType        = "state", /* state button is true or false and put a "stateOff" attribute on the UI */
      .get_value_cb = s_get_trace_status_cb
    },
    {
      .pTitle       = "Cycles Count",
      .pID          = "ToolBar#02",
      .pCmd         = "set_cycles_cnt {0}",
      .pType        = "state", /* state button is true or false and put a "stateOff" attribute on the UI */
      .get_value_cb = s_get_cycles_cnt_status_cb
    },
    #ifdef USE_ETHERNET
    {
      .pTitle       = "Network Traces",
      .pID          = "ToolBar#03",
      .pCmd         = "set_net_traces {0}",
      .pType        = "state",  /* state button  is true or false and put a "stateOff" attribute  on the UI */
      .get_value_cb = s_get_net_trace_status_cb
    },
    #endif
  };
  jsonID  toolsID = JSON_ID_NULL;
  jsonErr jsError = JSON_OK;

  JSON_CREATE_ARRAY(jsError, pInstance, &toolsID);
  JSON_OBJECT_SET_NEW(jsError, pInstance, root,     "ToolsBar", toolsID);
  for (size_t a = 0UL; (jsError == JSON_OK) && (a < (sizeof(tToolsBar) / sizeof(tToolsBar[0]))); a++)
  {
    jsonID toolsEntry = JSON_ID_NULL;

    JSON_CREATE_OBJECT(jsError, pInstance, &toolsEntry);
    JSON_OBJECT_SET_STRING(jsError, pInstance, toolsEntry,  "", "Title", tToolsBar[a].pTitle);
    JSON_OBJECT_SET_STRING(jsError, pInstance, toolsEntry,  "", "ID",    tToolsBar[a].pID);
    JSON_OBJECT_SET_STRING(jsError, pInstance, toolsEntry,  "", "Cmd",   tToolsBar[a].pCmd);
    JSON_OBJECT_SET_STRING(jsError, pInstance, toolsEntry,  "", "Type",  tToolsBar[a].pType);
    if (tToolsBar[a].get_value_cb != NULL)
    {
      uint64_t u64 = tToolsBar[a].get_value_cb();
      JSON_OBJECT_SET_UNSIGNED_INTEGER(jsError, pInstance, toolsEntry, "", "Value", u64);
    }
    JSON_ARRAY_APPEND_NEW(jsError, pInstance, toolsID, toolsEntry);
  }
  if (jsError != JSON_OK)
  {
    UTIL_TERM_printf("%s, %s(), line %d: error %d\n", __FILE__, __FUNCTION__, __LINE__, jsError);
  }

  return jsError;
}


/**
* @brief Remove unexpected chars by a space
*
* @param pString the string
* @param ichar   the char to remove
*/

static void s_update_json_graph_remove_unexpected_char(char *pString, char ichar)
{
  while (*pString)
  {
    if (*pString == ichar)
    {
      *pString = ' ';
    }
    pString ++;
  }
}


/**
* @brief Add graph connections
*
* @param root json root id
*/
static jsonErr s_update_json_graph_connections(json_pack_t *const pInstance, jsonID const root)
{
  /* iterate for all instances */
  jsonErr jsError = JSON_OK;
  jsonID  graphID = JSON_ID_NULL;

  JSON_CREATE_ARRAY(jsError, pInstance, &graphID);
  JSON_OBJECT_SET_NEW(jsError, pInstance, root, "Graph", graphID);

  for (audio_algo_list_t *pCurrent = AudioChain_getAlgosList(&AudioChainInstance); (jsError == JSON_OK) && (pCurrent != NULL); pCurrent = pCurrent->next)
  {
    audio_algo_t *const pAlgo = pCurrent->pAlgo;

    /* record pin out connected to pin in */
    if (AudioAlgo_getChunkPtrOut(pAlgo, 0U) != NULL)
    {
      int outPin = 0;

      for (audio_chunk_list_t *pPinListOut = AudioAlgo_getChunksOut(pAlgo); (jsError == JSON_OK) && (pPinListOut != NULL); pPinListOut = pPinListOut->next)
      {
        if (pPinListOut->pChunk != NULL)
        {
          /* we get the connection or the pin in */
          uint8_t inPinId;
          uint8_t inAlgoId;

          if (AudioError_isOk(AudioChainInstance_getChunkAlgoIn(pPinListOut->pChunk, &inAlgoId, &inPinId)))
          {
            char   tTmp[MAX_CHUNK_DESCR_STR_SIZE + 16];
            char   tDesc[MAX_CHUNK_DESCR_STR_SIZE] = "";
            jsonID tmpId = 0U;

            AudioChunk_getDescriptionString(pPinListOut->pChunk, tDesc, sizeof(tDesc));
            /* description should not have # */
            s_update_json_graph_remove_unexpected_char(tDesc, '#');

            snprintf(tTmp, sizeof(tTmp), "%d#%d#%d#%d#%s", (int)AudioAlgo_getIndex(pAlgo), outPin, (int)inAlgoId, (int)inPinId, tDesc);
            JSON_CREATE_STRING(jsError, pInstance, tTmp, &tmpId);
            JSON_ARRAY_APPEND_NEW(jsError, pInstance, graphID, tmpId);

            // chunk's description as string: may be added as chunk info in the graph

          }
        }
        outPin++;
      }
    }
  }
  if (jsError != JSON_OK)
  {
    UTIL_TERM_printf("%s, %s(), line %d: error %d \n", __FILE__, __FUNCTION__, __LINE__, jsError);
  }
  return jsError;
}


/**
* @brief Add system inputs/outputs info
*
* @param jsonID_sysIos json jsonID_sysIos id
*/
static jsonErr s_add_json_graph_system_ios_description(json_pack_t *pInstance, jsonID jsonID_sysIos, uint8_t algoId, uint8_t pinId, audio_chunk_t *pChunk, const char *strType)
{
  jsonErr jsError = JSON_OK;

