stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_cmd.c
  char   tTmp[MAX_CHUNK_DESCR_STR_SIZE + 16];
  char   tDesc[MAX_CHUNK_DESCR_STR_SIZE] = "";
  jsonID tmpId = 0U;

  AudioChunk_getDescriptionString(pChunk, tDesc, sizeof(tDesc));
  /* description should not have # */
  s_update_json_graph_remove_unexpected_char(tDesc, '#');
  snprintf(tTmp, sizeof(tTmp), "%d#%d#%s#%s", (int)algoId, (int)pinId, tDesc, strType);
  JSON_CREATE_STRING(jsError, pInstance, tTmp,   &tmpId);
  JSON_ARRAY_APPEND_NEW(jsError, pInstance, jsonID_sysIos, tmpId);
  return jsError;
}


/**
* @brief Add system inputs/outputs info
*
* @param jsonID_sysIos json jsonID_sysIos id
*/
static jsonErr s_update_json_graph_system_chunk(json_pack_t *const pInstance, jsonID const jsonID_sysIos, audio_chunk_list_t *const pChunkList, const char *const strType)
{
  jsonErr jsError = JSON_OK;
  int32_t acError = AUDIO_ERR_MGNT_NONE;

  for (audio_chunk_list_t *pCurrent = pChunkList; (jsError == JSON_OK) && (pCurrent != NULL); pCurrent = pCurrent->next)
  {
    if (pCurrent->pChunk != NULL)
    {
      uint8_t pinId, algoId;

      if (AudioChunk_getType(pCurrent->pChunk) == AUDIO_CHUNK_TYPE_SYS_IN)
      {
        acError = AudioChainInstance_getChunkAlgoIn(pCurrent->pChunk, &algoId, &pinId);
        if (AudioError_isOk(acError)) /* acError = AUDIO_ERR_MGNT_NOT_FOUND if error while searching the id*/
        {
          jsError = s_add_json_graph_system_ios_description(pInstance, jsonID_sysIos, algoId, pinId, pCurrent->pChunk, strType);
        }
      }
      else if (AudioChunk_getType(pCurrent->pChunk) == AUDIO_CHUNK_TYPE_SYS_OUT)
      {
        acError = AudioChainInstance_getChunkAlgoOut(pCurrent->pChunk, &algoId, &pinId);
        if (AudioError_isOk(acError)) /* acError = AUDIO_ERR_MGNT_NOT_FOUND if error while searching the id*/
        {
          jsError = s_add_json_graph_system_ios_description(pInstance, jsonID_sysIos, algoId, pinId, pCurrent->pChunk, strType);
        }
      }
    }
  }
  return jsError;
}


/**
* @brief Add system inputs/outputs info
*
* @param root json root id
*/
static jsonErr s_update_json_graph_system_ios(json_pack_t *const pInstance, jsonID const root)
{
  /* iterate for all instances */
  jsonErr jsError = JSON_OK;
  jsonID  graphID = JSON_ID_NULL;

  JSON_CREATE_ARRAY(jsError, pInstance, &graphID);
  JSON_OBJECT_SET_NEW(jsError, pInstance, root, "SystemIOs", graphID);

  for (audio_algo_list_t *pCurrent = AudioChain_getAlgosList(&AudioChainInstance); (jsError == JSON_OK) && (pCurrent != NULL); pCurrent = pCurrent->next)
  {
    audio_algo_t *const pAlgo = pCurrent->pAlgo;

    /* record pin out connected to pin in */
    if (AudioAlgo_getChunkPtrIn(pAlgo, 0U) != NULL)
    {
      jsError = s_update_json_graph_system_chunk(pInstance, graphID, AudioAlgo_getChunksIn(pAlgo), "src");
    }

    if (AudioAlgo_getChunkPtrOut(pAlgo, 0U) != NULL)
    {
      jsError = s_update_json_graph_system_chunk(pInstance, graphID, AudioAlgo_getChunksOut(pAlgo), "sink");
    }
  }
  if (jsError != JSON_OK)
  {
    UTIL_TERM_printf("%s, %s(), line %d: error %d\n", __FILE__, __FUNCTION__, __LINE__, jsError);
  }
  return jsError;
}


/**
* @brief prints the configuration file
*
* @param argc  num args
* @param argv  args list
*/
static void s_cmd_get_cfg(int argc, char *argv[])
{
  uint8_t  bOk      = FALSE;
  uint16_t dumpFlag = JSON_INDENT;

  /* compact produces a json without indentation, it is faster to download */
  if (argc == 1)
  {
    bOk = TRUE;
  }
  else if (argc == 2)
  {
    if (strcmp(argv[1], "compact") == 0)
    {
      bOk      = TRUE;
      dumpFlag = 0;
    }
  }
  else
  {
    UTIL_TERM_printf("%s command: wrong number of arguments\n", argv[0]);
  }

  if (bOk)
  {
    jsonErr     jsError   = JSON_OK;
    json_pack_t jsonInst  = {0};
    jsonID      root      = JSON_ID_NULL;
    jsonID      algos     = JSON_ID_NULL;
    int32_t     iInstance = 0;

    JSON_CREATE_OBJECT(jsError, &jsonInst, &root);

    /* generate the tile file */
    JSON_OBJECT_SET_STRING(jsError, &jsonInst, root, "", "Title",       AudioChainInstance.pName);
    JSON_OBJECT_SET_STRING(jsError, &jsonInst, root, "", "Description", AudioChainInstance.pDesc);
    JSON_OBJECT_SET_STRING(jsError, &jsonInst, root, "", "Version",     AC_VERSION);

    jsError = s_get_cfg_build_tools_bar(&jsonInst, root);

    /* create the first properties: { */
    JSON_CREATE_ARRAY(jsError, &jsonInst, &algos);
    JSON_OBJECT_SET_NEW(jsError, &jsonInst, root, "Algos", algos);

    /* iterate for all instances */
    for (audio_algo_list_t *pCurrent = AudioChain_getAlgosList(&AudioChainInstance); (jsError == JSON_OK) && (pCurrent != NULL); pCurrent = pCurrent->next)
    {
      audio_algo_t *const pAlgo      = pCurrent->pAlgo;
      jsonID              algoJsonId = 0U;

      JSON_CREATE_OBJECT(jsError, &jsonInst, &algoJsonId);
      if (pAlgo->pDesc != NULL)
      {
        JSON_OBJECT_SET_STRING(jsError, &jsonInst, algoJsonId, "", "Description", pAlgo->pDesc);
      }
      else
      {
        JSON_OBJECT_SET_STRING(jsError, &jsonInst, algoJsonId, "", "Description", "");
      }
      JSON_OBJECT_SET_STRING(jsError, &jsonInst, algoJsonId, "", "Title", pAlgo->pName);
      JSON_OBJECT_SET_UNSIGNED_INTEGER(jsError, &jsonInst, algoJsonId, "", "PinOut", (uint64_t)AudioChunkList_getNbElements(AudioAlgo_getChunksOut(pAlgo)));
      JSON_OBJECT_SET_UNSIGNED_INTEGER(jsError, &jsonInst, algoJsonId, "", "PinIn", (uint64_t)AudioChunkList_getNbElements(AudioAlgo_getChunksIn(pAlgo)));
      JSON_OBJECT_SET_UNSIGNED_INTEGER(jsError, &jsonInst, algoJsonId, "", "InstanceNum", (uint64_t)AudioAlgo_getIndex(pAlgo));
      /* generate visibility */
      //JSON_OBJECT_SET_BOOLEAN(jsError, &jsonInst, algoJsonId, "", "Disabled", (AudioAlgo_getState(pAlgo) == AUDIO_ALGO_TUNING_DISABLED) ? TRUE : FALSE);

      JSON_ARRAY_APPEND_NEW(jsError, &jsonInst, algos, algoJsonId);
      /* create the static array */
      jsError = s_update_json_from_ac_params(&jsonInst, algoJsonId, pAlgo, AUDIO_ALGO_STATIC_PARAM);
      jsError = s_update_json_from_ac_params(&jsonInst, algoJsonId, pAlgo, AUDIO_ALGO_DYNAMIC_PARAM);
      iInstance++;
    }

    jsError = s_update_json_graph_connections(&jsonInst, root);
    jsError = s_update_json_graph_system_ios(&jsonInst, root);

    JSON_OBJECT_SET_INTEGER(jsError, &jsonInst, root, "", "InstanceNumber", (int64_t)iInstance);

    if (jsError == JSON_OK)
    {
      char *pJson = (char *)json_dumps(&jsonInst, root, dumpFlag);
      //char *pJson = (char *)json_dumps(&jsonInst, root, JSON_INDENT);

      if (pJson != NULL)
      {
        UTIL_TERM_puts(pJson);
        UTIL_TERM_puts("\n");
        json_free(pJson);
      }

      json_shutdown(&jsonInst);
    }
  }
}


#ifdef USE_ETHERNET
static void s_cmd_set_net_traces_state(int argc, char *argv[])
{
  bool enable;

  if (s_check_args_boolean(argc, argv, &enable))
  {
    net_set_trace_status(enable);
  }
}


static uint32_t s_get_net_trace_status_cb(void)
{
  return (uint32_t)net_get_trace_status();
}
#endif

static void s_cmd_get_generic_info(int argc, char *argv[])
{
  get_infos();
}


