stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_cmd.c
//static void s_cmd_toggle_usb_rec(int argc, char *argv[])
//{
//  toggle_usb_rec();
//}
//
//__weak void  toggle_usb_rec(void)
//{
//}


__weak void  get_infos(void)
{
}


#if defined(AUDIO_CHAIN_ACSDK_USED) || defined(AUDIO_CHAIN_CONF_TUNING_CLI_USED)
static jsonErr s_update_json_from_ac_params(json_pack_t *const pInstance, jsonID const algoJsonId, audio_algo_t *const pAlgo, audio_algo_tuning_stat_dyn_param_t const statDynParam)
{
  jsonErr jsError         = JSON_OK;
  jsonID  paramTypeJsonId = JSON_ID_NULL;
  uint8_t nbParams        = 0U;

  JSON_CREATE_ARRAY(jsError, pInstance, &paramTypeJsonId);
  JSON_OBJECT_SET_NEW(jsError, pInstance, algoJsonId, s_pStrJsonParamType[statDynParam], paramTypeJsonId);

  if (jsError == JSON_OK)
  {
    int32_t error = AudioAlgoTuning_getParamsNb(pAlgo, statDynParam, &nbParams, NULL);

    if (AudioError_isError(error))
    {
      UTIL_TERM_printf("%s, %s(), line %d: AudioAlgoTuning_getParamsNb error %d  %d \"%s\" \"%s\"\n", __FILE__, __FUNCTION__, __LINE__, error);
      jsError = JSON_ERROR;
    }
  }
  for (uint8_t paramId = 0U; (jsError == JSON_OK) && (paramId < nbParams); paramId++)
  {
    jsError = s_update_json_from_ac_param(pInstance, paramTypeJsonId, pAlgo, statDynParam, paramId);
  }

  if (jsError != JSON_OK)
  {
    UTIL_TERM_printf("%s, %s(), line %d: error %d  %d \"%s\" \"%s\"\n", __FILE__, __FUNCTION__, __LINE__, jsError, algoJsonId, pAlgo->pName, s_pStrJsonParamType[(statDynParam)]);
  }
  return jsError;
}


static void s_cmd_get_all_algo_param_list(int argc, char *argv[])
{
  if (AudioChain_getAlgosList(&AudioChainInstance) == NULL)
  {
    UTIL_TERM_printf("No Audio Chain is instantiated\n");
  }
  for (audio_algo_list_t *pCurrent = AudioChain_getAlgosList(&AudioChainInstance); pCurrent != NULL; pCurrent = pCurrent->next)
  {
    char  string[4];
    char *newArgv[2];

    snprintf(string, sizeof(string), "%d", AudioAlgo_getIndex(pCurrent->pAlgo));
    newArgv[0] = argv[0];
    newArgv[1] = string;
    s_cmd_get_all_param_list(2, newArgv);
  }
}


static void s_cmd_get_all_param_list(int argc, char *argv[])
{
  s_cmd_get_static_param_list(argc, argv);
  s_cmd_get_dynamic_param_list(argc, argv);
}


static void s_cmd_get_static_param_list(int argc, char *argv[])
{
  s_args_get_param_list(argc, argv, AUDIO_ALGO_STATIC_PARAM);
}


static void s_cmd_get_dynamic_param_list(int argc, char *argv[])
{
  s_args_get_param_list(argc, argv, AUDIO_ALGO_DYNAMIC_PARAM);
}


static void s_cmd_get_static_param_val(int argc, char *argv[])
{
  s_args_get_param_val(argc, argv, AUDIO_ALGO_STATIC_PARAM);
}


static void s_cmd_get_dynamic_param_val(int argc, char *argv[])
{
  s_args_get_param_val(argc, argv, AUDIO_ALGO_DYNAMIC_PARAM);
}


static void s_cmd_set_static_param_val(int argc, char *argv[])
{
  s_args_set_param_val(argc, argv, AUDIO_ALGO_STATIC_PARAM);
}


static void s_cmd_set_dynamic_param_val(int argc, char *argv[])
{
  s_args_set_param_val(argc, argv, AUDIO_ALGO_DYNAMIC_PARAM);
}


static void s_cmd_apply_static_param_val(int argc, char *argv[])
{
  if (s_args_set_param_val(argc, argv, AUDIO_ALGO_STATIC_PARAM))
  {
    s_cmd_apply_cfg(argc - 2, argv);
  }
}


static void s_cmd_apply_dynamic_param_val(int argc, char *argv[])
{
  if (s_args_set_param_val(argc, argv, AUDIO_ALGO_DYNAMIC_PARAM))
  {
    s_cmd_apply_cfg(argc - 2, argv);
  }
}


static void s_args_get_param_list(int argc, char *argv[], audio_algo_tuning_stat_dyn_param_t const statDynParam)
{
  audio_algo_t *pAlgo;
  uint8_t       algoId;

  if (s_check_args_algoId(argc, argv, &pAlgo, &algoId))
  {
    // algo found
    char          const *const paramTypeString = s_pStrParamType[statDynParam];
    int32_t                    error;
    uint8_t                    nbParams;

    error = AudioAlgoTuning_getParamsNb(pAlgo, statDynParam, &nbParams, NULL);
    if (AudioError_isOk(error))
    {
      UTIL_TERM_printf("algo %d: %s %s, %d %s param%s\n", algoId, pAlgo->pName, pAlgo->pDesc, nbParams, paramTypeString, (nbParams > 1U) ? "s" : "");
      for (uint8_t paramId = 0U; paramId < nbParams; paramId++)
      {
        s_print_param_val(pAlgo, algoId, statDynParam, paramId);
      }
    }
    else
    {
      UTIL_TERM_printf("%s command: algo %d get number of %s param error %d\n", argv[0], algoId, paramTypeString, error);
    }
  }
}


static void s_args_get_param_val(int argc, char *argv[], audio_algo_tuning_stat_dyn_param_t const statDynParam)
{
  audio_algo_t *pAlgo;
  uint8_t       algoId, paramId;

  if (s_check_args_algoId_paramId(argc, argv, &pAlgo, &algoId, &paramId, statDynParam))
  {
    s_print_param_val(pAlgo, algoId, statDynParam, paramId);
  }
}


static int s_args_set_param_val(int argc, char *argv[], audio_algo_tuning_stat_dyn_param_t const statDynParam)
{
  audio_algo_t *pAlgo;
  uint8_t       algoId, paramId;
  int           ret = s_check_args_algoId_paramId(argc - 1, argv, &pAlgo, &algoId, &paramId, statDynParam);

  if (ret)
  {
    s_set_param_val(pAlgo, algoId, statDynParam, paramId, argv[3]);
  }

  return ret;
}


static void s_cmd_apply_cfg(int argc, char *argv[])
{
  audio_algo_t *pAlgo;
  uint8_t       algoId;

  if (s_check_args_algoId(argc, argv, &pAlgo, &algoId))
  {
    // algo found
    int32_t error;

    error = AudioAlgo_requestTuningUpdate(pAlgo);
    if (AudioError_isError(error))
    {
      UTIL_TERM_printf("ERROR %s: AudioAlgo_requestTuningUpdate failed; error = %d\n", __FUNCTION__, error);
    }
  }
}


static void s_print_param_val(audio_algo_t *const pAlgo, uint8_t const algoId, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId)
{
  char valString[AC_PARAM_NAME_LENGTH_MAX];

  if (AudioError_isOk(s_getParamValStrWithName(pAlgo, algoId, statDynParam, paramId, valString, AC_PARAM_NAME_LENGTH_MAX)))
  {
    UTIL_TERM_printf("  %2d: %s\n", paramId, valString);
  }
}


static void s_set_param_val(audio_algo_t *const pAlgo, uint8_t const algoId, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId, char *const pStrParamVal)
{
  char valString[AC_PARAM_NAME_LENGTH_MAX];

