stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_cmd.c
  if (AudioError_isOk(s_getParamValStrWithName(pAlgo, algoId, statDynParam, paramId, valString, AC_PARAM_NAME_LENGTH_MAX)))
  {
    int32_t                    error;
    char                      *pErrorString;

    error = AudioAlgoTuning_setParamValStr(pAlgo, statDynParam, paramId, pStrParamVal, &pErrorString);
    if (AudioError_isOk(error))
    {
      UTIL_TERM_printf("%s -> %s\n", valString, pStrParamVal);
    }
    else
    {
      UTIL_TERM_printf("algo %d, %s param %d: %s\n", algoId, s_pStrParamType[statDynParam], paramId, pErrorString);
    }
  }
}


static int32_t s_getParamValStrWithName(audio_algo_t *const pAlgo, uint8_t const algoId, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId, char *const pString, size_t const size)
{
  int32_t                    error;
  char                      *pErrorString;
  uint8_t                    nbParams;

  error = AudioAlgoTuning_getParamsNb(pAlgo, statDynParam, &nbParams, NULL);
  if (AudioError_isOk(error))
  {
    if (nbParams == 0U)
    {
      UTIL_TERM_printf("algo %d has no %s param\n", algoId, s_pStrParamType[statDynParam]);
      error = AUDIO_ERR_MGNT_ERROR;
    }
  }
  if (AudioError_isOk(error))
  {
    error = AudioAlgoTuning_getParamValStrWithName(pAlgo, statDynParam, paramId, pString, size, &pErrorString);
    if (AudioError_isError(error))
    {
      UTIL_TERM_printf("algo %d, %s param %d: %s\n", algoId, s_pStrParamType[statDynParam], paramId, pErrorString);
    }
  }

  return error;
}


static int s_check_args_algoId_paramId(int argc, char *argv[], audio_algo_t **const ppAlgo, uint8_t *const pAlgoId, uint8_t *const pParamId, audio_algo_tuning_stat_dyn_param_t const statDynParam)
{
  int ret = s_check_args_algoId(argc - 1, argv, ppAlgo, pAlgoId);

  if (ret)
  {
    if (AudioAlgoTuning_isUnsignedDecimal(argv[2]))
    {
      uint8_t paramId;
      uint8_t nbParams;

      errno = 0;
      paramId = (uint8_t)strtoul(argv[2], NULL, 10);
      if (errno != 0)
      {
        UTIL_TERM_printf("%s command: algo id %s %s param id %s, strtoul error\n", argv[0], argv[1], s_pStrParamType[statDynParam], argv[2]);
        ret = 0;
      }
      else if (AudioError_isOk(AudioAlgoTuning_getParamsNb(*ppAlgo, statDynParam, &nbParams, NULL)))
      {
        if (paramId < nbParams)
        {
          *pParamId = paramId;
        }
        else
        {
          UTIL_TERM_printf("%s command: algo id %s %s param id %s too big (>= %d)\n", argv[0], argv[1], s_pStrParamType[statDynParam], argv[2], nbParams);
          ret = 0;
        }
      }
      else
      {
        UTIL_TERM_printf("%s command: can't get algo id %s %s params number\n", argv[0], argv[1], s_pStrParamType[statDynParam]);
        ret = 0;
      }
    }
    else
    {
      UTIL_TERM_printf("%s command: param id %s is not an unsigned integer\n", argv[0], argv[2]);
      ret = 0;
    }
  }

  return ret;
}


static int s_check_args_algoId(int argc, char *argv[], audio_algo_t **const ppAlgo, uint8_t *const pAlgoId)
{
  int ret = 1;

  if (argc == 2)
  {
    if (AudioAlgoTuning_isUnsignedDecimal(argv[1]))
    {
      uint8_t algoId;

      errno = 0;
      algoId = (uint8_t)strtoul(argv[1], NULL, 10);
      if (errno != 0)
      {
        UTIL_TERM_printf("%s command: algo id %, strtoul error\n", argv[0], argv[1]);
        ret = 0;
      }
      else
      {
        audio_algo_t *const pAlgo  = AudioChain_getAlgoFromId(&AudioChainInstance, algoId);

        if (pAlgo == NULL)
        {
          // algo not found
          UTIL_TERM_printf("algo %s not found\n", argv[1]);
          ret = 0;
        }
        else
        {
          *ppAlgo  = pAlgo;
          *pAlgoId = algoId;
        }
      }
    }
    else
    {
      UTIL_TERM_printf("%s command: algo id %s is not an unsigned integer\n", argv[0], argv[1]);
      ret = 0;
    }
  }
  else
  {
    UTIL_TERM_printf("%s command: wrong number of arguments\n", argv[0]);
    ret = 0;
  }

  return ret;
}


/**
* @brief prints the configuration json schema for a parameter
*
* @param pInstance        json instance
* @param paramTypeJsonId  json root id
* @param pAlgo            algo pointer
* @param statDynParam     static or dynamic parameters
* @param paramId          parameter id
*/
static jsonErr s_update_json_from_ac_param(json_pack_t *const pInstance, jsonID const paramTypeJsonId, audio_algo_t *const pAlgo, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId)
{
  static const char *const tParamTypeString[AUDIO_ALGO_NB_PARAM_TYPES] =
  {
    [AUDIO_DESC_PARAM_TYPE_INT8]   = "PARAM_INT8",
    [AUDIO_DESC_PARAM_TYPE_UINT8]  = "PARAM_UINT8",
    [AUDIO_DESC_PARAM_TYPE_INT16]  = "PARAM_INT16",
    [AUDIO_DESC_PARAM_TYPE_UINT16] = "PARAM_UINT16",
    [AUDIO_DESC_PARAM_TYPE_INT32]  = "PARAM_INT32",
    [AUDIO_DESC_PARAM_TYPE_UINT32] = "PARAM_UINT32",
    [AUDIO_DESC_PARAM_TYPE_FLOAT]  = "PARAM_FLOAT"
  };
  int32_t                          error       = AUDIO_ERR_MGNT_NONE;
  jsonErr                          jsError     = JSON_OK;
  audio_descriptor_params_t const *pParamsDesc = NULL;
  audio_descriptor_param_t        *pParam      = NULL;
  jsonID                           paramJsonId = 0U;

  error = AudioAlgoTuning_getParamsDescr(pAlgo, statDynParam, &pParamsDesc, NULL);
  if (AudioError_isError(error))
  {
    UTIL_TERM_printf("%s, %s(), line %d: error AudioAlgoTuning_getParamsDescr %d \n", __FILE__, __FUNCTION__, __LINE__, error);
    jsError = JSON_ERROR;
  }
  else
  {
    if (pParamsDesc != NULL)
    {
      pParam = &pParamsDesc->pParam[paramId];
    }
  }
  if ((pParam != NULL) && (pParam->iParamFlag != AUDIO_DESC_PARAM_TYPE_FLAG_PRIVATE))
  {
    JSON_CREATE_OBJECT(jsError,     pInstance,                  &paramJsonId);
    JSON_ARRAY_APPEND_NEW(jsError,  pInstance, paramTypeJsonId, paramJsonId);
    JSON_OBJECT_SET_STRING(jsError, pInstance,                  paramJsonId, "", "Title",       pParam->pName);
    JSON_OBJECT_SET_STRING(jsError, pInstance,                  paramJsonId, "", "Description", pParam->pName);
    JSON_OBJECT_SET_STRING(jsError, pInstance,                  paramJsonId, "", "ParamType",   tParamTypeString[pParam->paramType]);
    JSON_OBJECT_SET_STRING(jsError, pInstance,                  paramJsonId, "", "ParamDesc",   "Description");

    if (jsError == JSON_OK)
    {
      audio_descriptor_type_union_t paramVal, paramMin, paramMax;
      char                   *pErrorString;

      error = AudioAlgoTuning_getParamVal(pAlgo, statDynParam, paramId, &paramVal, &pErrorString);
      if (AudioError_isError(error))
      {
        UTIL_TERM_printf("%s, %s(), line %d: error AudioAlgoTuning_getParamVal %s \n", __FILE__, __FUNCTION__, __LINE__, pErrorString);
        jsError = JSON_ERROR;
      }
      if (AudioError_isOk(error))
      {
        error = AudioAlgoTuning_getParamMin(pAlgo, statDynParam, paramId, &paramMin, &pErrorString);
        if (AudioError_isError(error))
        {
          UTIL_TERM_printf("%s, %s(), line %d: error AudioAlgoTuning_getParamMin %s \n", __FILE__, __FUNCTION__, __LINE__, pErrorString);
          jsError = JSON_ERROR;
        }
      }
      if (AudioError_isOk(error))
      {
        error = AudioAlgoTuning_getParamMax(pAlgo, statDynParam, paramId, &paramMax, &pErrorString);
        if (AudioError_isError(error))
        {
          UTIL_TERM_printf("%s, %s(), line %d: error AudioAlgoTuning_getParamMax %s \n", __FILE__, __FUNCTION__, __LINE__, pErrorString);
          jsError = JSON_ERROR;
        }
      }
      if (jsError == JSON_OK)
      {
        json_numData_t json_numData;

        switch (pParam->paramType)
        {
          case AUDIO_DESC_PARAM_TYPE_INT8:
            json_numData.dataType = JSON_SIGNED64;
            json_numData.val.s64 = (int64_t)paramVal.s8;
            json_numData.min.s64 = (int64_t)paramMin.s8;
            json_numData.max.s64 = (int64_t)paramMax.s8;
            break;
          case AUDIO_DESC_PARAM_TYPE_INT16:
            json_numData.dataType = JSON_SIGNED64;
            json_numData.val.s64 = (int64_t)paramVal.s16;
            json_numData.min.s64 = (int64_t)paramMin.s16;
            json_numData.max.s64 = (int64_t)paramMax.s16;
            break;
          case AUDIO_DESC_PARAM_TYPE_INT32:
            json_numData.dataType = JSON_SIGNED64;
            json_numData.val.s64 = (int64_t)paramVal.s32;
            json_numData.min.s64 = (int64_t)paramMin.s32;
            json_numData.max.s64 = (int64_t)paramMax.s32;
            break;
          case AUDIO_DESC_PARAM_TYPE_UINT8:
            json_numData.dataType = JSON_UNSIGNED64;
            json_numData.val.u64 = (uint64_t)paramVal.u8;
            json_numData.min.u64 = (uint64_t)paramMin.u8;
            json_numData.max.u64 = (uint64_t)paramMax.u8;
            break;
          case AUDIO_DESC_PARAM_TYPE_UINT16:
            json_numData.dataType = JSON_UNSIGNED64;
            json_numData.val.u64 = (uint64_t)paramVal.u16;
            json_numData.min.u64 = (uint64_t)paramMin.u16;
            json_numData.max.u64 = (uint64_t)paramMax.u16;
            break;
          case AUDIO_DESC_PARAM_TYPE_UINT32:
            json_numData.dataType = JSON_UNSIGNED64;
            json_numData.val.u64 = (uint64_t)paramVal.u32;
            json_numData.min.u64 = (uint64_t)paramMin.u32;
            json_numData.max.u64 = (uint64_t)paramMax.u32;
            break;
          case AUDIO_DESC_PARAM_TYPE_FLOAT:
            json_numData.dataType = JSON_DOUBLE;
            json_numData.val.dbl = (double)paramVal.f;
            json_numData.min.dbl = (double)paramMin.f;
            json_numData.max.dbl = (double)paramMax.f;
            break;
          default:
            /* Do Nothing MISRA */
            break;
        }
        JSON_OBJECT_SET_NUM_DATA(jsError, pInstance, paramJsonId, "", "Value",   &json_numData);
        /* copy min value in param's value because json_object_set_num_data creates json structure from param's value */
        json_numData.val = json_numData.min;
        JSON_OBJECT_SET_NUM_DATA(jsError, pInstance, paramJsonId, "", "Minimum", &json_numData);
        /* copy max value in param's value because json_object_set_num_data creates json structure from param's value */
        json_numData.val = json_numData.max;
        JSON_OBJECT_SET_NUM_DATA(jsError, pInstance, paramJsonId, "", "Maximum", &json_numData);
      }
    }
  }
  if (jsError != JSON_OK)
  {
    UTIL_TERM_printf("%s, %s(), line %d: error %d %d %d \"%s\" \"%s\"\n", __FILE__, __FUNCTION__, __LINE__, jsError, paramTypeJsonId, paramId, pAlgo->pName, s_pStrJsonParamType[(statDynParam)]);
  }
  return jsError;
}


/**
* @brief Re-config from a json
*
* @param argc  num args
* @param argv  args list
*/
static void s_cmd_set_cfg(int argc, char *argv[])
{
  static UTIL_TERM_CMD_t gContext;
  bool                   bQuiet = false;
  bool                   bOk    = false;

  if (argc == 1)
  {
    bOk = true;
  }
  else if (argc == 2)
  {
    /* the quiet mode remove the help text before to drag and drop the file.cfg in the terminal */
    if (strcmp(argv[1], "quiet") == 0)
    {
      bQuiet = true;
      bOk    = true;
    }
  }
  else
  {
    UTIL_TERM_printf("%s command: wrong number of arguments\n", argv[0]);
  }

