stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_cmd.c
  if (bOk)
  {
    int32_t  error   = UTIL_ERROR_NONE;
    uint32_t syncTmo = 60UL;
    uint32_t szCurTuningParams;

    if (!bQuiet)
    {
      UTIL_TERM_printf("Audio Chain Live Tuning\n");
      UTIL_TERM_printf("When the board is ready, the char 'C' is printed repeatedly during %d secs before the timeout.\n", syncTmo);
      UTIL_TERM_printf("Before the timeout, send a the *.json file or just paste its content from the terminal. For example, using teraterm (alt+v)\n");
    }

    error = UTIL_TERM_receive_raw_file((uint8_t *)gContext.pJsonBuff, UTIL_TERM_CMD_JSON_BUFF_SIZE, syncTmo * 1000UL, &szCurTuningParams);
    if (error == UTIL_ERROR_NONE)
    {
      UTIL_TERM_printf("\n");
    }

    if (error == UTIL_ERROR_NONE)
    {
      jsonErr     jsError         = JSON_OK;
      json_pack_t jsonInst        = {0};
      uint8_t     iInstanceCount  = AudioChain_getNbAlgos(&AudioChainInstance);
      jsonID      algosListJsonId = JSON_ID_NULL;
      uint16_t    algosNb         = 0U;
      uint64_t    nbInstance      = 0ULL;
      const char *pAudioChainName = NULL;
      const char *pAudioChainDesc = NULL;

      /* the text is in the buffer */
      UTIL_TERM_printf("Data received: %d bytes\n", szCurTuningParams);
      gContext.pJsonBuff[szCurTuningParams] = '\0';
      UTIL_TERM_puts(gContext.pJsonBuff);
      UTIL_TERM_puts("\n");

      /* let's start the json parsing */
      memset(&jsonInst, 0, sizeof(jsonInst));

      JSON_LOAD(jsError, &jsonInst, (const char *)gContext.pJsonBuff, &jsonInst.pack_root);
      JSON_OBJECT_GET_UNSIGNED_INTEGER(jsError, &jsonInst, jsonInst.pack_root, "", "InstanceNumber", &nbInstance);
      if (jsError == JSON_OK)
      {
        /* check instance number consistency */
        if ((uint8_t)nbInstance != iInstanceCount)
        {
          UTIL_TERM_printf("Configuration file not compatible\n");
          jsError = JSON_ERROR;
        }
      }
      /* parse the header title file */
      JSON_OBJECT_GET_STRING(jsError, &jsonInst, jsonInst.pack_root, "", "Title", &pAudioChainName);

      if (jsError == JSON_OK)
      {
        if (pAudioChainName != NULL)
        {
          UTIL_TERM_printf("Config Title       : %s\n", pAudioChainName);
        }
        JSON_OBJECT_GET_STRING(jsError, &jsonInst, jsonInst.pack_root, "", "Description", &pAudioChainDesc);
      }

      if (jsError == JSON_OK)
      {
        if (pAudioChainDesc != NULL)
        {
          UTIL_TERM_printf("Config Description : %s\n", pAudioChainDesc);
        }

        /* Iteration for all each instances */
        JSON_ARRAY_GET(jsError, JSON_OK, &jsonInst, jsonInst.pack_root, "Algos", &algosListJsonId);
      }

      JSON_LIST_GET_COUNT(jsError, &jsonInst, algosListJsonId, &algosNb);
      for (uint16_t algoId = 0U; (jsError == JSON_OK) && (algoId < algosNb); algoId++)
      {
        jsonID algoJsonId;
        if (json_list_pair(&jsonInst, algosListJsonId, algoId, NULL, &algoJsonId) == JSON_OK) /* do not manage error: it can be != JSON_OK even if there is no issue */
        {
          /* retrieve basic title infos */
          const char *pAlgoName = NULL;
          const char *pAlgoDesc = NULL;
          uint8_t     bDisabled = 0U;
          uint64_t    iInstance = 0ULL;

          JSON_OBJECT_GET_STRING(jsError,           &jsonInst, algoJsonId, "", "Title",       &pAlgoName);
          JSON_OBJECT_GET_STRING(jsError,           &jsonInst, algoJsonId, "", "Description", &pAlgoDesc);
          JSON_OBJECT_GET_BOOLEAN(jsError,          &jsonInst, algoJsonId, "", "Disabled",    &bDisabled);
          JSON_OBJECT_GET_UNSIGNED_INTEGER(jsError, &jsonInst, algoJsonId, "", "InstanceNum", &iInstance);
          if (jsError == JSON_OK)
          {
            if (iInstance >= nbInstance)
            {
              UTIL_TERM_printf("Wrong instance number %d>=%d\n", iInstance, nbInstance);
              jsError = JSON_ERROR;
            }
          }
          if (jsError == JSON_OK)
          {
            audio_algo_t *pAlgo = AudioChain_getAlgoFromId(&AudioChainInstance, (uint8_t)iInstance);

            if (pAlgo != NULL)
            {
              /* check the file coherency */
              if (strcmp(pAlgo->pName, pAlgoName) != 0)
              {
                pAlgo = NULL;
              }
            }

            /* Everything went fine, now update all parameters of the audio chain's algorithm */
            if (pAlgo != NULL)
            {
              /* Update visibility */
              //audio_algo_state_t algoState = AudioAlgo_getState(pAlgo);
              //if (bDisabled)
              //{
              //  algoState &= ~AUDIO_ALGO_TUNING_DISABLED;
              //}
              //else
              //{
              //  algoState |= AUDIO_ALGO_TUNING_DISABLED;
              //}
              //AudioAlgo_setState(pAlgo, algoState);
              UTIL_TERM_printf("\tParsing algo : %s:%s\n", (pAlgoName != NULL) ? pAlgoName : "none", (pAlgoDesc != NULL) ? pAlgoDesc : "none");

              /* update static & dynamic params (algo is disabled during this update) */
              jsError = s_update_ac_params_from_json(&jsonInst, algoJsonId, pAlgo, AUDIO_ALGO_STATIC_PARAM);
              jsError = s_update_ac_params_from_json(&jsonInst, algoJsonId, pAlgo, AUDIO_ALGO_DYNAMIC_PARAM);

              /* apply new algo's config */
              if (jsError == JSON_OK)
              {
                error = AudioAlgo_requestTuningUpdate(pAlgo);
                if (AudioError_isError(error))
                {
                  UTIL_TERM_printf("ERROR %s: AudioAlgo_requestTuningUpdate failed; error = %d\n", __FUNCTION__, error);
                  jsError = JSON_ERROR;
                }
              }
            }
            else
            {
              UTIL_TERM_printf("\talgo : %s not found\n", (pAlgoName != NULL) ? pAlgoName : "none");
            }
          }
        }
      }

      /* cleanup */
      if (jsonInst.pack_root == JSON_ID_NULL)
      {
        UTIL_TERM_printf("\tJson parse error:\n");
        UTIL_TERM_puts(gContext.pJsonBuff);
      }
      json_shutdown(&jsonInst);
    }
    else
    {
      UTIL_TERM_printf("\tJson parsing error\n");
    }
    //  if (error != UTIL_ERROR_ALLOC)
    //  {
    //    UTIL_TERM_Free(pTuningParams);
    //  }
  }
}


/**
* @brief Parse json parameters & update audio chain
*
* @param pInstance  json instance
* @param jsonID     algo json id handle
* @param pParams    algo params
*/
static jsonErr s_update_ac_params_from_json(json_pack_t *const pInstance, jsonID const algoJsonId, audio_algo_t *const pAlgo, audio_algo_tuning_stat_dyn_param_t const statDynParam)
{
  jsonErr  jsError         = JSON_OK;
  jsonID   paramTypeJsonId = JSON_ID_NULL;
  uint16_t paramNb         = 0U;

