stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Middlewares/ST/Audio-Kit/src/helpers/stm32_term_cmd.c
  JSON_ARRAY_GET(jsError, JSON_ERR_FOUND, pInstance, algoJsonId, s_pStrJsonParamType[statDynParam], &paramTypeJsonId);
  if (jsError == JSON_ERR_FOUND)
  {
    jsError = JSON_OK;
  }
  else
  {
    JSON_LIST_GET_COUNT(jsError, pInstance, paramTypeJsonId, &paramNb);

    for (uint8_t paramId = 0U; (jsError == JSON_OK) && (paramId < paramNb); paramId++)
    {
      jsError = s_update_ac_param_from_json(pInstance, paramTypeJsonId, pAlgo, statDynParam, paramId);
    }
  }
  if (jsError != JSON_OK)
  {
    UTIL_TERM_printf("%s, %s(), line %d: error %d %d \"%s\" \"%s\"\n", __FILE__, __FUNCTION__, __LINE__, jsError, algoJsonId, pAlgo->pName, s_pStrJsonParamType[(statDynParam)]);
  }
  return jsError;
}


/**
* @brief Parse json parameters & update audio chain
*
* @param pInstance  json instance
* @param jsonID     algo json id handle
* @param pParams    algo params
*/
static jsonErr s_update_ac_param_from_json(json_pack_t *const pInstance, jsonID const paramTypeJsonId, audio_algo_t *const pAlgo, audio_algo_tuning_stat_dyn_param_t const statDynParam, uint8_t const paramId)
{
  jsonErr                           jsError      = JSON_OK;
  int32_t                           error        = AUDIO_ERR_MGNT_NONE;
  char                             *pErrorString = NULL;
  jsonID                            paramJsonId  = JSON_ID_NULL;
  audio_descriptor_params_t const  *pParamsDesc  = NULL;
  const char                       *pParamName   = NULL;
  char                             *pStrParamVal = NULL;

  error = AudioAlgoTuning_getParamsDescr(pAlgo, statDynParam, &pParamsDesc, NULL);
  if (AudioError_isError(error))
  {
    UTIL_TERM_printf("%s, %s(), line %d: AudioAlgoTuning_getParamsDescr error %d\n", __FILE__, __FUNCTION__, __LINE__, error);
    jsError = JSON_ERROR;
  }
  if ((pParamsDesc != NULL) && (pParamsDesc->pParam[paramId].iParamFlag != AUDIO_DESC_PARAM_TYPE_FLAG_PRIVATE))
  {
    JSON_LIST_PAIR(jsError, pInstance, paramTypeJsonId, (uint16_t)paramId, NULL, &paramJsonId);
    JSON_OBJECT_GET_STRING(jsError, pInstance, paramJsonId, "", "Title", &pParamName);
    if (jsError == JSON_OK)
    {
      if (strcmp(pParamName, pParamsDesc->pParam[paramId].pName) != 0)
      {
        UTIL_TERM_printf("%s, %s(), line %d: param name issue (\"%s\" != \"%s\")\n", __FILE__, __FUNCTION__, __LINE__, pParamName, pParamsDesc->pParam[paramId].pName);
        jsError = JSON_ERROR;
      }
    }

    /* Update values */
    JSON_OBJECT_GET_STRING(jsError, pInstance, paramJsonId, "", "Value", (const char **)&pStrParamVal);

    if (jsError == JSON_OK)
    {
      error = AudioAlgoTuning_setParamValStr(pAlgo, statDynParam, paramId, pStrParamVal, &pErrorString);
      if (AudioError_isError(error))
      {
        UTIL_TERM_printf("%s, %s(), line %d: AudioAlgoTuning_setParamValStr failed for %s param %s; error = %d %s\n", __FILE__, __FUNCTION__, __LINE__, s_pStrParamType[statDynParam], (pParamName != NULL) ? pParamName : "none", error, pErrorString);
        jsError = JSON_ERROR;
      }
    }

  }
  if (jsError != JSON_OK)
  {
    UTIL_TERM_printf("%s, %s(), line %d: error %d %d %d \"%s\" \"%s\"\n", __FILE__, __FUNCTION__, __LINE__, jsError, paramTypeJsonId, paramId, pAlgo->pName, s_pStrJsonParamType[(statDynParam)]);
  }
  return jsError;
}

#else // AUDIO_CHAIN_ACSDK_USED || AUDIO_CHAIN_CONF_TUNING_CLI_USED

static jsonErr s_update_json_from_ac_params(json_pack_t *const pInstance, jsonID const algoJsonId, audio_algo_t *const pAlgo, audio_algo_tuning_stat_dyn_param_t const statDynParam)
{
  return JSON_OK;
}

#endif // AUDIO_CHAIN_ACSDK_USED || AUDIO_CHAIN_CONF_TUNING_CLI_USED
